OFtutorial9_runtimePostprocessingUtility/testCase/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../system/runConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($flowVelocity 0 0);

boundaryField
{
    inlet
    {
        type       fixedValue;
        value		$internalField;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        value           $internalField;
    }
    pipe
    {
    	type fixedValue;
    	value uniform (0 0 0);
    }
    "symmetry.*"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
